# labels = {
#     "fruits_labels": ['大白菜', '葡萄', '菠萝', '毛桃', '红辣椒'],
#     # "fruits_veges_labels": ['菜花', '土豆', '芒果', '菠萝', '石榴', '辣椒', '姜', '猕猴桃', '洋葱', '大蒜', '大白菜', '豌豆', '生菜', '西瓜', '橙子', '茄子', '香蕉', '柠檬', '芜菁', '胡萝卜', '甜菜根', '梨', '玉米', '番茄', '黄瓜', '菠菜', '地瓜', '萝卜', '青椒', '卷心菜', '苹果', '黄豆', '葡萄'],
#     "fruits_veges_labels": ['菜花', '葡萄', '芒果', '菠萝', '石榴', '辣椒', '姜', '猕猴桃', '洋葱', '大蒜', '大白菜', '豌豆', '生菜', '西瓜', '橙子', '茄子', '香蕉', '柠檬', '芜菁', '胡萝卜', '甜菜根', '梨', '玉米', '番茄', '黄瓜', '菠菜', '地瓜', '萝卜', '青椒', '卷心菜', '苹果', '黄豆', '葡萄'],
#     "fruits_veges_fake_labels": ['芒果', '甜柿子', '彩椒', '未成熟杨桃', '贵妃芒果', '橙子', '香蕉', '胡萝卜', '黄瓜', '青苹果', '成熟杨桃', '红苹果', '青椒']
# }

class AI_Config:
    # 基本设置
    window_name = "fruits"

    CAM_HEIGHT = 480
    CAM_WIDTH = 640

    INPUT_SIZE = (224, 224)   # (h, w)

    # 模型标签
    FRUITS_LABEL = ['芒果', '甜柿子', '彩椒', '未成熟杨桃', '贵妃芒果',
                    '橙子', '香蕉', '胡萝卜', '黄瓜', '青苹果', '成熟杨桃',
                    '红苹果', '青椒']

    FRUITS_M = [1.3, 2.4, 1.2, 4.5, 6.1, 3.1, 4.2, 5.3, 1.6, 1.9, 2.0, 6.2, 1.3, 4.2]

    # 模型路径
    FRUITS_MODEL_PATH = "./resource/model_zoo/fruits_veges_fake_model.tflite"
    FONT_PATH = "./resource/font/simsun.ttc"
    FONT_SIZE = 20

ai_cfg = AI_Config()